{
  "id": "amzn-4mqIKRL",
  "title": "PyroPet Kisa Cat Candle (Burgundy) - The Original Cat Candle with Metallic Skeleton | Halloween Decor | Unique Gift for Cat Lovers | 20-Hr Burn Time | Dimensions: 6.7x2.9x4.5 in",
  "url": "https://amzn.to/4mqIKRL",
  "price": "$40.00",
  "image": "/assets/amazon-sitestripe/amzn-4mqIKRL.svg",
  "rating": 4.8,
  "total_reviews": 1316,
  "features": [
    "Unique Cat-Shaped Candle: The Kisa candle is a cute cat shaped candle that reveals the wild beast inside her, a grinning metallic skeleton with fire blazing in her eyes!",
    "Icelandic Design: Crafted by Icelandic designer Thorunn Arnadottir, this candle captivates before, during, and after burning. Its intricate details and unique design make it a perfect conversation starter.",
    "Quality Materials: Hand-poured with 100% pure paraffin wax and featuring a lead-free cotton wick for a cleaner burn. Inside awaits a durable aluminum skeleton. Sized 6.7 x 2.9 x 4.5 inches, enjoy a burn time of 20-25 hours.",
    "Sustainable Packaging: Packaged in recyclable kraft paper and cushioned with plant-based, water-soluble packing materials.",
    "Certified for Safety: The 'Kisa' cat candle meets stringent US and EU safety standards. Enjoy peace of mind knowing each light is synonymous with quality and safety."
  ],
  "keywords": [
    "pyropet",
    "pyropet store",
    "pyropet kisa cat candle (burgundy) - the original cat candle with metallic skeleton | halloween decor | unique gift for cat lovers | 20-hr burn time | dimensions: 6.7x2.9x4.5 in",
    "pyropet pyropet kisa cat candle (burgundy) - the original cat candle with metallic skeleton | halloween decor | unique gift for cat lovers | 20-hr burn time | dimensions: 6.7x2.9x4.5 in",
    "pyropet kisa",
    "the kisa candle",
    "unique cat-shaped candle",
    "crafted by icelandic",
    "icelandic design crafted",
    "hand-poured with 100",
    "quality materials hand-poured",
    "packaged in recyclable",
    "sustainable packaging packaged",
    "the kisa' cat",
    "certified for safety"
  ],
  "category_slug": "kids-and-family",
  "category": "Family Time"
}
