{
  "id": "amzn-4nEUSjb",
  "title": "WOLFBOX MF50 Compressed Air Duster-110000RPM Super Power Electric Air Duster, 3-Gear Adjustable Mini Blower with Fast Charging, Dust Blower for Computer, Keyboard, House, Outdoor and Car",
  "url": "https://amzn.to/4nEUSjb",
  "price": "$95.81",
  "image": "/assets/amazon-sitestripe/amzn-4nEUSjb.svg",
  "rating": 4.6,
  "total_reviews": 3424,
  "features": [
    "Powerful Turbo Fan:WOLFBOX MegaFlow50 electric air duster reaches speeds of up to 110,000 RPM, effectively removing dust and debris. It features three adjustable speed settings to suit different cleaning tasks.",
    "Economical and Reusable: Built from durable materials with a long-lasting battery, the WOLFBOX MF50 is a sustainable alternative to disposable air cans, enhancing your cleaning experience.",
    "Portable and Lightweight: Weighing only 0.45 lb, this compact air duster is easy to carry. The included lanyard ensures convenient use both indoors and outdoors.",
    "Wide Application: WOLFBOX MF50 electric air duster comes with 4 nozzles, making it suitable for a variety of scenes, such as pc, keyboards, or other electronic devices. It also serves well for home clean and car duster.",
    "3.5 Hours Fast Charging: WOLFBOX MF50 electric air duster recharges in just 3.5 hours with a type-C cable. Enjoy up to 240 minutes of use on the lowest setting, with four charging options to suit your needs.",
    "24 Months & Support: WOLFBOX MegaFlow50 electric air duster comes with a 24-month guarantee and 24/7 customer service. During this period, we will resolve any issues related to the product, installation, or usage for you."
  ],
  "keywords": [
    "wolfbox",
    "wolfbox store",
    "wolfbox mf50 compressed air duster-110000rpm super power electric air duster",
    "wolfbox wolfbox mf50 compressed air duster-110000rpm super power electric air duster",
    "dust blower for computer",
    "wolfbox mf50",
    "wolfbox megaflow50 electric",
    "powerful turbo fan",
    "built from durable",
    "economical and reusable",
    "weighing only 45",
    "portable and lightweight",
    "wolfbox mf50 electric",
    "wide application wolfbox",
    "hours fast charging"
  ],
  "category_slug": "fandom-and-collectibles",
  "category": "For Fandom"
}
