{
  "id": "amzn-3K5sHeG",
  "title": "LcFun Waterproof Electric Dual Arc Lighter USB Rechargeable Outdoor Windproof Flameless Plasma Lighters for Camping, Hiking, Adventure, Survival Tactical Gear Stocking Stuffers Gifts for Men",
  "url": "https://amzn.to/3K5sHeG",
  "price": "$8.09",
  "image": "/assets/amazon-sitestripe/amzn-3K5sHeG.svg",
  "rating": 4.5,
  "total_reviews": 17480,
  "features": [
    "WATERPROOF DESIGN: waterproof lighter, metal-ring sealed cover and locking clasp, IP56 WATERPROOF allows them work well in rainy day and windy day.",
    "USB RECHARGABLE LIGHTER: The flameless dual arc lighter is powered by a rechargeable lithium battery, usb rechargeable electronic lighter, about 2 hours full charged. No gas or butane required, no more refilling, convenient and easy to use",
    "CONVENIENT & DURABLE: Comes with a thick paracord lanyard, this camping lighter should be in every camper, hiker, hunter, fisherman and outdoors person’s pack. High-quality ABS and Zinc Alloy material, durable",
    "GIFT IDEA: windproof and flameless, it is a creative combination of portability and functionality. The arc lighter is a ideal gift choice for men on Fathers Day, Birthday, Thanksgiving, Christmas stocking stuffers",
    "LcFun SERVICE: 60-days guarantee, if you have any issues or questions with our product, please feel free to contact us. We will answer and provide a perfect solution for you as soon as possible",
    "Warning: Do not use it with metal products"
  ],
  "keywords": [
    "lcfun",
    "lcfun store",
    "lcfun waterproof electric dual arc lighter usb rechargeable outdoor windproof flameless plasma lighters for camping",
    "lcfun lcfun waterproof electric dual arc lighter usb rechargeable outdoor windproof flameless plasma lighters for camping",
    "lcfun waterproof",
    "waterproof lighter metal-ring",
    "waterproof design waterproof",
    "the flameless dual",
    "usb rechargable lighter",
    "comes with thick",
    "convenient durable comes",
    "camping grill gear",
    "windproof and flameless",
    "gift idea windproof",
    "gift for grill lovers"
  ],
  "category_slug": "tech-and-gadgets",
  "category": "For a Techy"
}
