{
  "id": "amzn-42AXrKO",
  "title": "Jumway Not A Day Over Fabulous Mug Gifts Set- Birthday Gifts for Women - Funny Birthday Gift Ideas for Her,Friends, Coworkers, Her, Wife, Mom, Daughter, Sister, Aunt Ceramic Marble Mug 14 Oz",
  "url": "https://amzn.to/42AXrKO",
  "price": "$38.31",
  "image": "/assets/amazon-sitestripe/amzn-42AXrKO.svg",
  "rating": 4.8,
  "total_reviews": 1881,
  "features": [
    "PERFECT NOVELTY GIFT FOR ANY FABULOUS WOMEN: Great birthday gift ideas for yourself, your female best friends, besties, BFF, cousin, girl friends, sister in law, mom, wife, grandma, gigi, nana, aunt, daughter, daugther in law, teacher, empl…",
    "UNIQUE PRESENT FOR MANY OCCASIONS: The printed funny saying “Not a Day Over Fabulous” makes a unique gift as positive reminder that they are getting more fabulous than ever when celebrating their 21st, 30th, 40th, 50th, 60th, 70th, 80th, 90…",
    "Gift Box Packing: All you get are showing in the Pic. Comes in Stylish Packaging with all-around protection. This item is ready for gift giving.",
    "Elegant Hand Made: Each Mug’s pattern is unique，which symbolizes the unique love!Great Value, Gold and Marble Design ! Dishwasher safe but no Microwave safe.",
    "Multi-Purpose: The high quality coffee mug is not only a nice gift, but also a useful mug cup that perfect for coffee, milk, tea, water, neither hot nor cold beverage."
  ],
  "keywords": [
    "jumway",
    "jumway store",
    "jumway not a day over fabulous mug gifts set- birthday gifts for women - funny birthday gift ideas for her",
    "jumway jumway not a day over fabulous mug gifts set- birthday gifts for women - funny birthday gift ideas for her",
    "jumway not",
    "great birthday gift",
    "perfect novelty gift",
    "gift for grill lovers",
    "the printed funny",
    "unique present for",
    "all you get",
    "gift box packing",
    "each mug pattern",
    "elegant hand made",
    "the high quality"
  ],
  "category_slug": "fandom-and-collectibles",
  "category": "For Fandom"
}
