{
  "id": "amzn-4gvyDty",
  "title": "Nostalgia Tabletop Indoor Electric S'mores Maker - Smores Kit With Marshmallow Roasting Sticks and 4 Trays for Graham Crackers, Chocolate, and Marshmallows - Movie Night Supplies - Brown",
  "url": "https://amzn.to/4gvyDty",
  "price": "$29.99",
  "image": "/assets/amazon-sitestripe/amzn-4gvyDty.svg",
  "rating": 4.4,
  "total_reviews": 19004,
  "features": [
    "INDOOR FUN: Family night done right. Bring all the excitement of this campfire tradition right into the comfort of your home. Our home smores maker gives you all the equipment to make perfectly roasted s'mores every time",
    "FLAMELESS HEATER: Forget the hassle of cutting wood and open flames. This portable unit is built with safety in mind. The electric flameless heater requires nothing but an outlet to start making perfect golden brown s'mores",
    "ROASTING FORKS: The indoor marshmallow roaster includes 2 stainless steel forks to keep hands safe from the heater and 4-compartment trays that allow accessibility to share your ingredients with everyone at the table",
    "EASY TO CLEAN: This durable smores-making kit has a sturdy base and easy-to-disassemble trays, making it quick and simple to wash after every use",
    "NOSTALGIA: From designs inspired by early 19th century America to the timeless appeal of our appliances, we offer unique, novel, and fun products for the family. We preserve the past, embrace the present, and look forward to the future"
  ],
  "keywords": [
    "nostalgia",
    "nostalgia store",
    "nostalgia tabletop indoor electric s'mores maker - smores kit with marshmallow roasting sticks and 4 trays for graham crackers",
    "nostalgia nostalgia tabletop indoor electric s'mores maker - smores kit with marshmallow roasting sticks and 4 trays for graham crackers",
    "nostalgia tabletop",
    "family night done",
    "indoor fun family",
    "forget the hassle",
    "flameless heater forget",
    "the indoor marshmallow",
    "roasting forks the",
    "304 stainless steel",
    "stainless steel basket",
    "this durable smores-making",
    "easy to clean"
  ],
  "category_slug": "fitness-and-wellness",
  "category": "Wellness Warriors"
}
