{
  "id": "amzn-3K47stH",
  "title": "Toilet Golf Game-Practice Mini Golf in Any Restroom/Bathroom - Great Toilet Time - Dad Gifts, Funny Gifts for Dad, Funny White Elephant Gifts, Gag Gifts for Husband, Boyfriend, Men",
  "url": "https://amzn.to/3K47stH",
  "price": "$87.11",
  "image": "/assets/amazon-sitestripe/amzn-3K47stH.svg",
  "rating": 4.4,
  "total_reviews": 4401,
  "features": [
    "Toilet Golf: The toilet game with 3D lawn printing, which make the scene more realistic.",
    "Putter Training: This funny golf gifts which Is also cool gifts for golfers helps the golf lovers improve their putter skills; especially for people who don’t have much time to go to the golf course",
    "Golf Gifts for Men : This fun gifts for men offer a funny way for your father to pass boring time while on the potty; the gag gifts for men provide a funy way to make dad laugh. Struggling with what gifts for dad ?",
    "Gag Gifts Funny Adult: This funny dad gifts Is ideal funny gifts for men, funny gifts for adults, funny dad gifts, gifts for men who have everything , or anyone who appreciates awkward humor. (Yes, it’s a real game. Yes, it’s ridiculous.)",
    "White Elephant Gifts for Adults: Whether it’s a funny birthday gifts for men, funny gifts for boyfriend, or white elephant gifts for adults funny, This toilet Golf is the perfect choice.",
    "Top Gifts for Men 2025: Made by GOODLYSPORTS- a professional manufacturer of golf toys and golf games. We have our own factory producing golf toys, which can bring more fun to your life"
  ],
  "keywords": [
    "goodlysports",
    "goodlysports store",
    "toilet golf game-practice mini golf in any restroom/bathroom - great toilet time - dad gifts",
    "goodlysports toilet golf game-practice mini golf in any restroom/bathroom - great toilet time - dad gifts",
    "funny gifts for dad",
    "funny white elephant gifts",
    "toilet golf",
    "the toilet game",
    "toilet golf the",
    "this funny golf",
    "putter training this",
    "gift for grill lovers",
    "this fun gifts",
    "golf gifts for",
    "this funny dad"
  ],
  "category_slug": "gifts-for-her",
  "category": "For Her"
}
