{
  "id": "amzn-46q86sS",
  "title": "Smart Hummingbird Feeder with Camera Solar Powered, AI Identify, Instant Notification, Leakproof & Ant Moat, Outdoors Hanging, Idea Gift for Bird Lovers (20 oz)",
  "url": "https://amzn.to/46q86sS",
  "price": "$52.99",
  "image": "/assets/amazon-sitestripe/amzn-46q86sS.svg",
  "rating": 4.0,
  "total_reviews": 107,
  "features": [
    "【World’s First Interactive Birding App】RichBird smart hummingbird feeder with camera seamlessly pairs with CoolFly – the first-ever app designed for interactive birdwatching!",
    "【Lifetime Free AI Bird ID】Receive instant alerts when hummingbirds visit your hummingbird feeder camera. Watch, save, and share recorded clips in the CoolFly app.",
    "【Live HD Birdwatching】RichBird hummingbird feeders for outdoors seamlessly connects to your Wi-Fi network (supports 2.4GHz only), and features a 3MP HD camera with instant motion detection—capturing ingbirds in under 1 second.",
    "【Hummingbird Magnet with Ant-Proof Design】RichBird camera hummingbird feeder specially crafted vibrant red feeding ports, scientifically proven to attract ingbirds, feature built-in ant guards that keep nectar pure, paired with leak-proof f…",
    "【Large Capacity & Leak-proof Design】The RichBird hummingbird Feeder’s transparent reservoir allows easy nectar monitoring, with a 20oz capacity to minimize refills.",
    "【24/7 Solar Monitoring & Weatherproof】RichBird hummingbird Feeder powered by eco-friendly solar energy, it guarantees a continuous 24/7 ingbird watching experience."
  ],
  "keywords": [
    "richbird",
    "richbird store",
    "smart hummingbird feeder with camera solar powered",
    "richbird smart hummingbird feeder with camera solar powered",
    "ai identify",
    "instant notification",
    "smart hummingbird",
    "world’s first interactive birding app",
    "lifetime free ai bird id",
    "live hd birdwatching",
    "hummingbird magnet with ant-proof design",
    "large capacity & leak-proof design",
    "24/7 solar monitoring & weatherproof"
  ],
  "category_slug": "gifts-for-her",
  "category": "For Her"
}
