{
  "id": "amzn-4gs7xUf",
  "title": "Emotional Support Pickles by Relatable, Cuddly Stuffed Animals and Toys, Squishy Toys and Plushies, Perfect Funny Pickle Gifts for Loved Ones of All Ages, Includes 5 Plushies with Carrying Basket",
  "url": "https://amzn.to/4gs7xUf",
  "price": "$164.62",
  "image": "/assets/amazon-sitestripe/amzn-4gs7xUf.svg",
  "rating": 4.3,
  "total_reviews": 3610,
  "features": [
    "Emotional Support Pickles are soft and snuggly plushies that make the perfect plush comfort buddy. A playful addition to school supplies for kids, this set doubles as a thoughtful school stress relief gift for teachers and students.",
    "More Fun: Need to show your appreciation? These pickles are more than just cute gifts—they make a thoughtful classroom stress relief plush or an anxiety plush for kids, perfect for teachers, students, or anyone who could use a smile.",
    "Smiling Friends: Includes 1 cozy container and 5 individual plush pickles. Each funny character comes with its own name, personality, and expression. Choose a favorite or take the whole crew with you.",
    "Memorable and Shareable: Enjoy cute stuff? These pickles are perfect toys for ages 2-4 and any Gen Z or Millenial loved ones. Soft, cuddly, and delightful, nobody can resist our most adorable pals.",
    "Collect Them All: Discover even more to love from Relatable! Check out the full collection of Emotional Support Plushies—including nuggets, fries, and pizza— plus other cute things and interesting finds."
  ],
  "keywords": [
    "what do you meme?",
    "what do you meme? store",
    "emotional support pickles by relatable",
    "what do you meme? emotional support pickles by relatable",
    "squishy toys and plushies",
    "emotional support",
    "emotional support pickles",
    "gift for grill lovers",
    "need to show",
    "more fun need",
    "includes cozy container",
    "smiling friends includes",
    "enjoy cute stuff",
    "memorable and shareable",
    "discover even more"
  ],
  "category_slug": "fandom-and-collectibles",
  "category": "For Fandom"
}
