{
  "id": "amzn-4gs2vH2",
  "title": "Taco vs Burrito - The Wildly Popular Surprisingly Strategic Card Game Created by a 7 Year Old - 5 Ways to Play - a Family-Friendly Party Game for Kids, Teens & Adults",
  "url": "https://amzn.to/4gs2vH2",
  "price": "$19.99",
  "image": "/assets/amazon-sitestripe/amzn-4gs2vH2.svg",
  "rating": 4.5,
  "total_reviews": 27496,
  "features": [
    "Quick to Learn, Exciting to Play: Easy to learn with quick gameplay and unexpected Action Cards. Games last 15 minutes. Learn in 3 minutes and compete to create the wildest meal for victory!",
    "Created by a 7-year-old: Taco vs Burrito started when Alex (age 7) proclaimed that he wanted to create a game.",
    "Ideal Gift for Every Occasion: Whether it's a Birthday, Christmas, Graduation, Hanukkah, Thanksgiving, Halloween, or any special gathering, this game is a fantastic gift for anyone who loves board games or card games",
    "Complete Set for Epic Fun: Taco vs Burrito core game has 56 cards (ingredients and actions), 4 taco/burrito meal holders, 3 quick start cards, and a rule book. For 2-4 players, ages 6 to 106+.",
    "Family Bonding Time Redefined: Bring everyone together with this captivating game. Whether it's a cozy family night, a playdate for kids, or a friendly competition among siblings, Taco vs Burrito is sure to create memorable moments."
  ],
  "keywords": [
    "taco vs burrito",
    "taco vs burrito store",
    "taco vs burrito - the wildly popular surprisingly strategic card game created by a 7 year old - 5 ways to play - a family-friendly party game for kids",
    "taco vs burrito taco vs burrito - the wildly popular surprisingly strategic card game created by a 7 year old - 5 ways to play - a family-friendly party game for kids",
    "teens & adults",
    "taco vs",
    "easy to learn",
    "quick to learn",
    "created by 7-year-old",
    "whether it's birthday",
    "ideal gift for",
    "gift for grill lovers",
    "complete set for",
    "bring everyone together",
    "family bonding time"
  ],
  "category_slug": "entertainment-and-games",
  "category": "For Gamers"
}
