{
  "id": "amzn-4mgADqL",
  "title": "Keypad Smart Door Lock with Handle: Kucacci Keyless Entry Fingerprint Lock - Digital Code Handle with Keypad - Electronic Smart Knob for Front Door - Deadbolt Alternative with App - Easy Installation",
  "url": "https://amzn.to/4mgADqL",
  "price": "$190.19",
  "image": "/assets/amazon-sitestripe/amzn-4mgADqL.svg",
  "rating": 4.3,
  "total_reviews": 4612,
  "features": [
    "【Unlock with ease】KUCACCI Smart Door Lock offers Fingerprint, Passcode, App, Key Fob, Key, Wifi and Voice Control (with a Wifi Gateway needed to buy separately). Never be locked out again! Perfect for families with kids and seniors.",
    "【Easy DIY Installation】No drilling or locksmith needed. Simply replace your existing lock in 10 minutes with a screwdriver. Fits doors 1-3/8’’ to 1-31/32’’ thick.",
    "【Super Convenience】Effortlessly manage all the smart locks with the App. Authorize admins, create codes, share e-keys, and track records, making it perfect for Airbnb hosts and self-housing residents.",
    "【Long-lasting Security】With AES256 encryption, our smart lock guarantees the highest level of privacy for the fingerprint sensor and user data. Moreover, it works under outdoor doors with eaves or interior doors.",
    "【Secure Peace of Mind】Elevate your home security with the KUCACCI fingerprint door lock. Enjoy lifetime free app access, backed by 30-day money-back guarantee and a 1-year product warranty. Your home, your peace of mind."
  ],
  "keywords": [
    "kucacci",
    "kucacci store",
    "keypad smart door lock with handle: kucacci keyless entry fingerprint lock - digital code handle with keypad - electronic smart knob for front door - deadbolt alternative with app - easy installation",
    "kucacci keypad smart door lock with handle: kucacci keyless entry fingerprint lock - digital code handle with keypad - electronic smart knob for front door - deadbolt alternative with app - easy installation",
    "keypad smart",
    "unlock with ease",
    "easy diy installation",
    "super convenience",
    "long-lasting security",
    "secure peace of mind"
  ],
  "category_slug": "office-and-productivity",
  "category": "Productivity Power-Ups"
}
