{
  "id": "amzn-3K3A32p",
  "title": "YATSKIA Chakra Crystal Tree - Handmade Healing Crystal Trees with 7 Chakra Stones - Decorative Tree of Life for Meditation, Feng Shui, and Home Decor - Unique Birthday Gifts for Women",
  "url": "https://amzn.to/3K3A32p",
  "price": "$191.58",
  "image": "/assets/amazon-sitestripe/amzn-3K3A32p.svg",
  "rating": 4.6,
  "total_reviews": 2181,
  "features": [
    "Crystal",
    "Beautifully Handcrafted Chakra Tree: This Yatskia Chakra Crystal Tree features all seven chakra gemstones with a wooden base and a golden wire trunk covered with m-seal.",
    "Natural Healing Crystals: The branches of this feng shui tree are adorned with seven natural semi-precious gemstones, including Red Jasper, Amethyst, Lapis Lazuli, Carnelian, Clear Quartz, Yellow Aventurine, and Green Aventurine.",
    "Chakra Points Explained: The seven chakras refer to energy points that store and regulate energy.",
    "Versatile Feng Shui Tree: Known as the Feng Shui Money Tree, this crystal tree can be used for multiple purposes, including chakra healing, manifesting good luck, wealth, prosperity, and success.",
    "Note - All our chakra trees are made by hand using natural crystals. We positioned every effort into delivering you the maximum efficient bonsai trees, both for gifting functions, decoration purposes, or self-use."
  ],
  "keywords": [
    "yatskia",
    "yatskia store",
    "yatskia chakra crystal tree - handmade healing crystal trees with 7 chakra stones - decorative tree of life for meditation",
    "yatskia yatskia chakra crystal tree - handmade healing crystal trees with 7 chakra stones - decorative tree of life for meditation",
    "feng shui",
    "yatskia chakra",
    "crystal",
    "this yatskia chakra",
    "beautifully handcrafted chakra",
    "the branches of",
    "natural healing crystals",
    "the seven chakras",
    "chakra points explained",
    "known as the",
    "versatile feng shui"
  ],
  "category_slug": "gifts-for-him",
  "category": "For Him"
}
