{
  "id": "amzn-47LTdUj",
  "title": "Planters' Choice 9 Herb Indoor Window Garden Kit - House Plants Seeds - Best Unique Gift Ideas for Women, Mom, Friend, Her, Birthday, Housewarming, Mother - New Home Kitchen Gifts - Live Plant Starter",
  "url": "https://amzn.to/47LTdUj",
  "price": "$125.75",
  "image": "/assets/amazon-sitestripe/amzn-47LTdUj.svg",
  "rating": 4.3,
  "total_reviews": 3412,
  "features": [
    "A LUSH OASIS IN YOUR HOME: Elevate your indoor space with a vibrant array of nine gourmet herbs. Feel the unparalleled freshness that only home-grown herbs can offer.",
    "THE ULTIMATE KIT: You get everything you need to start and sustain your herb garden. From seeds to full bloom, our kit ensures a seamless, hassle-free gardening experience.",
    "NO GREEN THUMB REQUIRED: Whether you're a seasoned gardener or just starting, our step-by-step guide simplifies the process.",
    "PREMIUM QUALITY SEEDS: Our heirloom seeds, premium-sourced and vacuum-sealed, provide the best results. While others give you subpar seeds, we promise optimal germination rates and robust growth.",
    "PLANT WITH POWER: Say goodbye to guesswork! Our nutrient-rich soil discs, pre-fertilized and expand 6-8 times their size, provide an optimal growth environment. Your plants will thank you with lush, vibrant growth.",
    "GIVE MORE THAN JUST A GIFT: This kit is more than a product; it's an experience of growth, learning, and culinary exploration."
  ],
  "keywords": [
    "planters' choice",
    "planters' choice store",
    "planters' choice 9 herb indoor window garden kit - house plants seeds - best unique gift ideas for women",
    "planters' choice planters' choice 9 herb indoor window garden kit - house plants seeds - best unique gift ideas for women",
    "elevate your indoor",
    "lush oasis in",
    "you get everything",
    "the ultimate kit",
    "whether you're seasoned",
    "no green thumb",
    "our heirloom seeds",
    "premium quality seeds",
    "say goodbye to",
    "plant with power",
    "this kit is"
  ],
  "category_slug": "home-and-kitchen",
  "category": "Homebody Upgrades"
}
