{
  "id": "amzn-4mnDJcJ",
  "title": "Eye Massager with Heat, Music, Compression, Adjustable Sleep Mask Massage Holiday Birthday Gifts for Women Men, Eye Massager for Migraine Reduce Stye Eye, Eye Strain Relief, Improve Sleep",
  "url": "https://amzn.to/4mnDJcJ",
  "price": "$52.32",
  "image": "/assets/amazon-sitestripe/amzn-4mnDJcJ.svg",
  "rating": 4.8,
  "total_reviews": 773,
  "features": [
    "New Year Birthday Gifts for Women: Eye massager built-in heating pads provide a comfortable temperature between 104 and 110 degrees Fahrenheit(40℃-43℃), more effectively improve symptoms such as dry eyes, and reduce dark circles.",
    "Gentle Reminder: 1.This device will cause normal noise <45 dB during use; 2.Adjust compression settings when you feel too strong; 3.Please find out if you are allergic to protein leather before use; 4.Limited range of music included, suppor…",
    "Take Care of Your Eye: Our eye machine adopts can make the skin around the eyes more relaxed.",
    "Enjoy Multi-functional Comfort: Beinkap eye massager can switch modes at will, offers 5 modes and customizable music（Notice: For each mode, that different modes have different experiences).",
    "Portable Design & 180°Foldable: Our electric eye strain relif device with a storage bag that can be folded into compact, so you can carry it to anywhere, such as office or traveling.",
    "Best Gifts for Your Lover: Beinkap eye massager is a warm mothers day, New Year, birthday, anniversary, Halloween, Valentine's Day gifts for women/men, is suitable for a wide range of people and situations, it's also best gifts for women, f…"
  ],
  "keywords": [
    "beinkap",
    "beinkap store",
    "eye massager with heat",
    "beinkap eye massager with heat",
    "eye massager",
    "eye massager built-in",
    "new year birthday",
    "gift for grill lovers",
    "this device will",
    "gentle reminder this",
    "our eye machine",
    "take care of",
    "beinkap eye massager",
    "enjoy multi-functional comfort",
    "our electric eye"
  ],
  "category_slug": "home-and-kitchen",
  "category": "Homebody Upgrades"
}
