{
  "id": "amzn-3Kditc9",
  "title": "COLORLIFE Twister Hurricane Light- Novelty Nature Decor Gift for Boys Girls, Men, Women Mini Water Vortex Maker Mood Night Light Birthday Holiday Christmas",
  "url": "https://amzn.to/3Kditc9",
  "price": "$22.98",
  "image": "/assets/amazon-sitestripe/amzn-3Kditc9.svg",
  "rating": 4.3,
  "total_reviews": 1059,
  "features": [
    "Perfect gift that will surprise and delight all ages:This novelty lamp produces an enthralling visual effect resembling a Twister when you power it up. It’s an eye catching decoration and a great conversation piece. .",
    "A great addition to any home and any occasion：This unique lighting fixture combines nature and modern technology to produce a stunning visual display as the small but majestic water twister dances gracefully inside the cylinder.",
    "Birthday holiday or Christmas gift for youth teen, kids, boys, girls, papa, grandpa, uncle, dad, father, men, women. typhoon expert dads, uncles, aunts, niece, nephew, sons and daughters.For storm, tornado chaser & weather enthusiast .",
    "HASSLE-FREE: Simply add your own water for a realistic extreme weather whirlpool maker at the side of your desk. Adapter + Driven by a whisper quiet motor in order to satisfy the requirements quite",
    "COMPLETE PEACE OF MIND: We created our new product totally from scratch, designing every part in our own factory。That's why we are so confident you'll love our twister mood lamp."
  ],
  "keywords": [
    "colorlife",
    "colorlife store",
    "colorlife twister hurricane light- novelty nature decor gift for boys girls",
    "colorlife colorlife twister hurricane light- novelty nature decor gift for boys girls",
    "colorlife twister",
    "this novelty lamp",
    "perfect gift that",
    "gift for grill lovers",
    "great addition to",
    "birthday holiday or",
    "simply add your",
    "hassle-free simply add",
    "we created our",
    "complete peace of"
  ],
  "category_slug": "fitness-and-wellness",
  "category": "Wellness Warriors"
}
