{
  "id": "amzn-4gB225K",
  "title": "Laughing Smith - Wet Farts - Potent Stink Spray - Extra Strong Stink - Hilarious Gag Gifts & Pranks for Adults or Kids - Prank Stink Stuff - Non Toxic - Smells Like Really 'Bad' Gas",
  "url": "https://amzn.to/4gB225K",
  "price": "$12.99",
  "image": "/assets/amazon-sitestripe/amzn-4gB225K.svg",
  "rating": 4.4,
  "total_reviews": 5973,
  "features": [
    "ULTIMATE STRENGTH FART SPRAY THAT SMELLS LIKE REALLY 'BAD' GAS! - Wet Farts potent bum stink spray from Laughing Smith lets you bombard your victims with a stinky wet cloud of fart that will make their face grimace and their eyes water!",
    "MAKE YOUR VICTIMS RUN FOR CLEAN AIR! - This stinky bum fart spray is so potent, your victims will be left gasping and running for fresh-smelling air with just one spray! To play the ultimate prank, use indoors for the strongest stench.",
    "TOTALLY NON-TOXIC - Our fart spray extra strong prank is made with non-toxic and non-flammable ingredients that are totally safe and effective. However, please be careful pranksters - this stuff stinks really BAAAAD!",
    "HILARIOUS GAG GIFTS FOR FART-LOVING KIDS & ADULTS - If your friends or family members find fart and poop jokes funny, they'll LOVE Wet Farts non aerosol fart spray!",
    "BOUTIQUE JOKES & PRANKS BY LAUGHING SMITH - We've developed our Wet Farts poop prank spray so you can unleash the realistic smell of seriously bad gas on your victims."
  ],
  "keywords": [
    "laughing smith",
    "laughing smith store",
    "laughing smith - wet farts - potent stink spray - extra strong stink - hilarious gag gifts & pranks for adults or kids - prank stink stuff - non toxic - smells like really 'bad' gas",
    "laughing smith laughing smith - wet farts - potent stink spray - extra strong stink - hilarious gag gifts & pranks for adults or kids - prank stink stuff - non toxic - smells like really 'bad' gas",
    "ultimate strength fart",
    "make your victims",
    "totally non-toxic our",
    "hilarious gag gifts",
    "gift for grill lovers",
    "boutique jokes pranks"
  ],
  "category_slug": "office-and-productivity",
  "category": "Productivity Power-Ups"
}
