{
  "id": "amzn-3K6IhXl",
  "title": "Doctor Pepper Candle - Smells Like The Real Soda - Cute Candles for Cool Gifts - Funny Candles for Any Occasion - Cute Things for Aesthetic Room Decor - Cool Candle for Cool Things",
  "url": "https://amzn.to/3K6IhXl",
  "price": "$24.99",
  "image": "/assets/amazon-sitestripe/amzn-3K6IhXl.svg",
  "rating": 4.4,
  "total_reviews": 438,
  "features": [
    "Cute Gifts That Wow - Experience the exhilarating aroma of your favorite soda with our Soda Candle! Ignite nostalgia and delight with every whiff, immersing yourself in a world of fizzy fun and sweet memories.",
    "Be The Gift Hero - From Birthdays to Holidays, Surprise your Loved ones with a Gift they'll treasure. Anakz Cute Candle caters to all Celebrations and the Ultimate Gifts for all ages, making you the ultimate Gift-Giving Superstar.",
    "Aromatic Cherry Bliss - Immerse yourself in a Fragrant Paradise. Your Funny Candle is a sensory delight, filling your space with the sweet aroma of Premium Soy Wax and Cherry.",
    "Bring Joy To Your Home - Add a touch of whimsy to your decor with your Cool Candle. Not only does it exude charm and personality, but it also serves as a conversation starter and mood lifter.",
    "Reusable Funky Candles - The Preppy Candle 4.2″ x 2.5″ isn't just a charming decor piece; it's a versatile marvel!"
  ],
  "keywords": [
    "anakz",
    "anakz store",
    "doctor pepper candle - smells like the real soda - cute candles for cool gifts - funny candles for any occasion - cute things for aesthetic room decor - cool candle for cool things",
    "anakz doctor pepper candle - smells like the real soda - cute candles for cool gifts - funny candles for any occasion - cute things for aesthetic room decor - cool candle for cool things",
    "doctor pepper",
    "cute gifts that",
    "gift for grill lovers",
    "be the gift",
    "aromatic cherry bliss",
    "bring joy to",
    "reusable funky candles"
  ],
  "category_slug": "entertainment-and-games",
  "category": "For Gamers"
}
