{
  "id": "amzn-4naXQvY",
  "title": "Hummingbird Solar Lanterns Outdoor Waterproof Hanging Solar Lights Hummingbird Gifts for Women Men Metal Decorative LED Hummingbird Lanterns for Garden Decor,Yard,Patio,Lawn,Tabletop,Pathway,Landscape",
  "url": "https://amzn.to/4naXQvY",
  "price": "$24.99",
  "image": "/assets/amazon-sitestripe/amzn-4naXQvY.svg",
  "rating": 4.7,
  "total_reviews": 244,
  "features": [
    "【Unique Garden Decor】Hummingbird solar lantern can project unique and beautiful patterns in a dim environment,creating a gorgeous and warm atmosphere to bring life and fun to your garden and attract your family or friends.The unique hollow…",
    "【Hummingbird Themed Gifts】Hummingbird symbolize life,beauty,eternity,wisdom,among other good meanings.This hummingbird solar hanging lantern is perfect for Mother's Day,Father's Day,Thanksgiving,Christmas,Valentine's Day,birthdays,weddings,…",
    "【Efficient Solar Powered】Before using,please press the button to put it in the \"on\" position.The hummingbird solar outdoor lantern will absorb sunlight to charge for about 6 hours during the day and will light up for about 8 hours at night.…",
    "【Durable&Waterproof】The main part,handmade with new upgraded high quality durable metal.The top of the light,consisting of bright LED lights and energy-efficient solar cells,is not only long-lasting,but also very energy-efficient and enviro…",
    "【Dedicated Customer Support】- Your satisfaction is our priority. Our team is available to assist with any inquiries and strive to provide prompt resolutions. For returns, we offer a 30-day hassle-free policy on eligible items."
  ],
  "keywords": [
    "eztzen",
    "eztzen store",
    "hummingbird solar lanterns outdoor waterproof hanging solar lights hummingbird gifts for women men metal decorative led hummingbird lanterns for garden decor",
    "eztzen hummingbird solar lanterns outdoor waterproof hanging solar lights hummingbird gifts for women men metal decorative led hummingbird lanterns for garden decor",
    "hummingbird solar",
    "unique garden decor",
    "hummingbird themed gifts",
    "gift for grill lovers",
    "efficient solar powered",
    "durable&waterproof",
    "dedicated customer support"
  ],
  "category_slug": "home-and-kitchen",
  "category": "Homebody Upgrades"
}
