{
  "id": "amzn-3VlllWY",
  "title": "Artalst Pasta Neon Sign Italian Noodles Led Light Spaghetti Neon Signs Italy Food Sign for Restaurant Food Shop Kitchen Dining Room Wall Decor Pasta Lover Gift",
  "url": "https://amzn.to/3VlllWY",
  "price": "$39.99",
  "image": "/assets/amazon-sitestripe/amzn-3VlllWY.svg",
  "rating": 4.7,
  "total_reviews": 3957,
  "features": [
    "Add a Touch of Italy to Your Home: Our neon pasta sign is the perfect way to bring a touch of Italian charm to your kitchen or dining room. The vibrant colors and playful design will make you feel like you're dining at a cozy trattoria.",
    "Customizable Ambiance: With its dimmable feature, you can adjust the brightness to suit your mood or occasion. Create a warm and inviting atmosphere for a romantic dinner or a fun and festive vibe for a family gathering.",
    "High-Quality Construction: Crafted with premium LED lights, this neon sign is built to last. The durable acrylic backing ensures long-lasting use, while the energy-efficient LED lights provide a soft, warm glow.",
    "Easy to Install: Simply plug the USB cord into any power source and adjust the brightness with the included inline dimmer. No assembly required!",
    "Perfect Present: Looking for a unique present for the pasta lover in your life? This neon sign is the perfect way to show your appreciation. It's also a great present for housewarmings, birthdays, or any occasion."
  ],
  "keywords": [
    "artlast",
    "artlast store",
    "artalst pasta neon sign italian noodles led light spaghetti neon signs italy food sign for restaurant food shop kitchen dining room wall decor pasta lover gift",
    "artlast artalst pasta neon sign italian noodles led light spaghetti neon signs italy food sign for restaurant food shop kitchen dining room wall decor pasta lover gift",
    "artalst pasta",
    "our neon pasta",
    "add touch of",
    "with its dimmable",
    "customizable ambiance with",
    "crafted with premium",
    "high-quality construction crafted",
    "simply plug the",
    "easy to install",
    "looking for unique",
    "perfect present looking"
  ],
  "category_slug": "tech-and-gadgets",
  "category": "For a Techy"
}
