{
  "id": "amzn-4pinekK",
  "title": "I'm Gay Rainbow Heat Change Mug - Funny Rude Mug - Message Appears as it Heats - Perfect Novelty Gag Gift, best funny gifts and pride accessories",
  "url": "https://amzn.to/4pinekK",
  "price": "$18.99",
  "image": "/assets/amazon-sitestripe/amzn-4pinekK.svg",
  "rating": 4.3,
  "total_reviews": 2358,
  "features": [
    "Unique Heat-Sensitive Design: This color-changing mug transforms from black to white when hot liquid is poured, revealing the fun and bold message, \"I Am Gay\" – perfect for prank gifts, funny white elephant gifts, or quirky Christmas gag gi…",
    "Perfect Novelty Gift: Ideal for gay gifts, dirty Santa gifts, or as a hilarious surprise for holiday white elephant gift exchanges. It's a standout choice for gag gifts funny adult and funny Christmas presents.",
    "High-Quality Ceramic Mug: Crafted with durable materials, this funny coffee mug is perfect for everyday use and makes a great addition to any collection of funny mugs or novelty coffee mugs.",
    "Inclusive and Fun: Celebrate pride and individuality with this thoughtful gift for the LGBTQ+ community, gifts for gay men, or even as a quirky gift for gay pride celebrations.",
    "Memorable and Practical: Whether you’re looking for best gifts for white elephant, gag gift coffee mugs, or gay men gifts, this heated coffee cup brings joy and laughter while serving a practical purpose!"
  ],
  "keywords": [
    "turtle straws",
    "turtle straws store",
    "i'm gay rainbow heat change mug - funny rude mug - message appears as it heats - perfect novelty gag gift",
    "turtle straws i'm gay rainbow heat change mug - funny rude mug - message appears as it heats - perfect novelty gag gift",
    "i'm gay",
    "this color-changing mug",
    "unique heat-sensitive design",
    "gift for grill lovers",
    "ideal for gay",
    "perfect novelty gift",
    "crafted with durable",
    "high-quality ceramic mug",
    "celebrate pride and",
    "inclusive and fun",
    "whether you re"
  ],
  "category_slug": "tech-and-gadgets",
  "category": "For a Techy"
}
