{
  "id": "amzn-48h0qvG",
  "title": "Ultrasonic Jewelry Cleaner, 48KHz Ultrasonic Cleaner Machine for Jewelry, Eyeglasses, Rings, Watch Strap, Dentures- Dual Cleaning Modes, 304 Stainless Steel Tank",
  "url": "https://amzn.to/48h0qvG",
  "price": "$196.55",
  "image": "/assets/amazon-sitestripe/amzn-48h0qvG.svg",
  "rating": 4.8,
  "total_reviews": 4214,
  "features": [
    "Professional Ultrasonic Jewelry Cleaner: The ultrasonic cleaning machine only requires tap water to clean dirty jewelry within minutes, without removing tarnish (adding ultrasonic cleaning agent solution can achieve better cleaning results)",
    "Multifunctional Jewelry Cleaner: The ultrasonic cleaning machine uses 48,000Hz high-frequency sound waves to clean items. Can be used to clean Eyeglasses, jewelry, dentures, watch coins, etc., without damaging delicate items",
    "Convenient to Use: The ultrasonic cleaner has two cleaning modes. Simply touch the power button, it will automatically clean items for 5 minutes, for watch strap or dirty object, it is suggested to use the mode of 7 minutes.",
    "Capacity and Portability: The capacity of sonic cleaner is 12oz, suitable for most kinds of eyeglasses and jewelry. The SUS 304 stainless steel tank has excellent corrosion resistance",
    "Package Contents: 1*ultrasonic jewelry cleaning machine, 1*watch stand, and 1*user manual. If you have any questions about this eyeglass cleaner, we offer a 12-month warranty and 100% satisfaction guarantee for this silver cleaner"
  ],
  "keywords": [
    "byaskziv",
    "byaskziv store",
    "ultrasonic jewelry cleaner",
    "byaskziv ultrasonic jewelry cleaner",
    "ultrasonic jewelry",
    "the ultrasonic cleaning",
    "professional ultrasonic jewelry",
    "multifunctional jewelry cleaner",
    "the ultrasonic cleaner",
    "convenient to use",
    "the capacity of",
    "capacity and portability",
    "304 stainless steel",
    "stainless steel basket",
    "ultrasonic jewelry cleaning"
  ],
  "category_slug": "entertainment-and-games",
  "category": "For Gamers"
}
