{
  "id": "amzn-3K7ykJh",
  "title": "Funny Star Trophy with Humorous Your Did It Inscription - Funny Graduation Gift Gifts for Coworkers Cute Desk Decor Birthday Gift Encouragement Gift Funny Gag Gifts",
  "url": "https://amzn.to/3K7ykJh",
  "price": "$9.99",
  "image": "/assets/amazon-sitestripe/amzn-3K7ykJh.svg",
  "rating": 4.6,
  "total_reviews": 144,
  "features": [
    "Quirky and Memorable Design: Celebrate achievements with a touch of humor using our \"Your did it\" trophy.",
    "Durable Construction: Crafted from sturdy resin, this trophy ensures durability and longevity.",
    "Ideal Size: With dimensions of 2.7 inches tall by 3.5 inches wide and 1.7 inches deep, it's compact enough to fit on any display space without overwhelming it, This is the perfect trinket to take up some space and remind you or someone you…",
    "Perfect for Gifting: A fun and sarcastic trophy to award a friend or yourself! Whether for friends, family, or colleagues, this trophy serves as a fun and sarcastic gift.",
    "Cultural and Meme Appeal: Based on the \"your did it\" star meme, this trophy is perfect for the meme enthusiast or someone who deserves a highly sarcastic \"good job\". It's a unique addition to any collection of novelty items or gag gifts."
  ],
  "keywords": [
    "legobayo",
    "legobayo store",
    "funny star trophy with humorous your did it inscription - funny graduation gift gifts for coworkers cute desk decor birthday gift encouragement gift funny gag gifts",
    "legobayo funny star trophy with humorous your did it inscription - funny graduation gift gifts for coworkers cute desk decor birthday gift encouragement gift funny gag gifts",
    "funny star",
    "celebrate achievements with",
    "quirky and memorable",
    "crafted from sturdy",
    "durable construction crafted",
    "with dimensions of",
    "ideal size with",
    "fun and sarcastic",
    "perfect for gifting",
    "gift for grill lovers",
    "based on the"
  ],
  "category_slug": "fandom-and-collectibles",
  "category": "For Fandom"
}
